:PROPERTIES:
#+title: Notes
:END:

A collection of notes concerning 42 Projects.

** references
Somewhat similar to pointers, in the sense that it is
pass-by-reference (instead of pass-by-value). Generally, in C++, you
use references when you can, and pointers when you need to. A few
guidelines:
  1) if you want to change the object passed, call by reference or use
     a pointer; e.g., ~void f(int & i) || void f(int * i)~
  2) if you don't want to change the object and it is big, call by
     const reference; e.g., ~void f(const & i)~
  3) otherwise, call by value; e.g. ~void f(int i)~

A reference is a const pointer that is always dereferenced and is
never NULL. The reference is not a copy or a pointer; it IS the
object. From the [[https://isocpp.org/wiki/faq/references#overview-refs][C++ FAQ]]:

#+begin_quote
Even though a reference is often implemented using an address in the
underlying assembly language, please do not think of a reference as a
funny looking pointer to an object. A reference is the object. It is
not a pointer to the object, nor a copy of the object. It is the
object.
#+end_quote

Use references when you want to pass-by-address instead of
pass-by-value.

#+BEGIN_SRC C++
#include <iostream>

int main(void)
{
  int num = 42;

  int& numRef = num;
  std::cout << num << numRef << std::endl;
}
#+END_SRC

#+RESULTS:
: 4242

** filestreams
As we've seen, we can interact with streams like stdout, stdin, and
stderr. All simple enough. And, as in C, you can interact with
filestreams. To do so, we use the ~<fstream>~ header.

#+NAME: filestreams
#+BEGIN_SRC C++
#include <fstream>
#include <iostream>

int main(void) {
  std::ifstream ifs("numbers");
  unsigned int dst;
  unsigned int dst2;

  ifs >> dst >> dst2;
  std::cout << dst << " " << dst2 << std::endl;
  ifs.close();
}
#+END_SRC

The line ~std::ifstream ifs("numbers")~ associates an input file
stream (ifstream) with the (opened) file 'numbers'.

A simple way to read through files. You can redirect output to any
kind of stream.

#+NAME: reading-filestreams
#+BEGIN_SRC C++ :results output
#include <fstream>
#include <string>
#include <iostream>

int main(void) {
  std::ofstream ofs;
  std::ifstream ifs;

  ifs.open("/Users/tgarriss/Projects/42/cpp/01/ex04/somefile.txt");
  ofs.open("/Users/tgarriss/Projects/42/cpp/01/ex04/somefile.replace");
  if (ifs.is_open())
  {
    std::string line;
    while (std::getline(ifs, line))
      ofs << line << std::endl;
  }
  else
    std::cout << "FAILURE!" << std::endl;
  return (0);
}
#+END_SRC

#+RESULTS: reading-filestreams

There are also string streams apparently. Look that up. I've written
some basic info about it in code... But that's not enough. There's
likely an initialization method to interact with a string or
something...

#+NAME: string-streams
#+BEGIN_SRC C++
#include <string>
#include <iostream>
#include <sstream>

int main(void) {
  std::stringstream ss;

  ss << 100 << ' ' << 200;

  int foo,bar;
  ss >> foo >> bar;
  std::cout << foo << std::endl;
  std::cout << bar << std::endl;
}
#+END_SRC

#+RESULTS: string-streams
: 100
: 200
** switch statements
switch statements are the same in CPP and C. They're straightforward
to use. Simply remember that they fall through:

#+NAME: switch-statements
#+BEGIN_SRC C++
#include <iostream>

int main(void) {
  int i;

  i = 1;
  switch (i) {
    case 1:
      std::cout << "Case 1!" << std::endl;
    case 2:
      std::cout << "Case 2!" << std::endl;
      break;
    case 3:
      std::cout << "Case 3!" << std::endl;

  }
}
#+END_SRC

#+RESULTS: switch-statements
| Case | 1! |
| Case | 2! |

** subtype polymorphism
Subtype polymorphism is basically the same thing as inheritance; it is
often called this, and class subtyping. It implies another logical
concept though, that of relationships between classes.

Run the ~main()~ below, you'll find that you can assign a Warrior
class to a Character object since a Warrior IS-A Character. It does
not work the other way around (a Character IS-NOT-ALWAYS a Warrior).
But, initializing it like that tells the compiler to use the functions
associated with the Character class. Obviously, this only works when
classes are related; the Cat class has no relationship with the
Warrior, nor the Character class, and therefore will throw an error at
compilation.

When classes are meant to be manipulated polymorphically, always make the base class's destructor virtual. What about the derived classes'?

#+NAME: polymorphism-virtual
#+BEGIN_SRC C++ :results output
#include <string>
#include <iostream>

class Character {
  public:
    void sayHello(std::string const & target);
    //virtual void sayHello(std::string const & target);
};

class Warrior : public Character {
  public:
    void sayHello(std::string const & target);
    //virtual void sayHello(std::string const & target);
};

class Cat {
  // ...
};

void Character::sayHello(std::string const & target) {
  std::cout << "Good day, " << target << " !" << std::endl;
}

void Warrior::sayHello(std::string const & target) {
  std::cout << "Go screw yourself, " << target << std::endl;
}

int main(void) {
  Character *a = new Character();
  Character *b = new Warrior();
  Warrior *c = new Warrior();
  Warrior *d = new Warrior();
  //Character *e = new Cat();

  a->sayHello("World");
  b->sayHello("Buttface");
  c->sayHello("Wormguts");
  d->sayHello("Water Buffalo");
  delete a, b, c, d;
}
#+END_SRC

#+RESULTS: polymorphism-virtual
: Good day, World !
: Good day, Buttface !
: Go screw yourself, Wormguts
: Go screw yourself, Water Buffalo

There is a way to get around that though, and it is to use the
~virtual~ keyword on a member function. Change the comments in the
code above to see how this works.

N.B.: 'methods' are virtual member functions.
